Repository: alisaieed/ResMenu
Catalog: lib/l10n/app_*.arb
Languages: ar

# enterResInfo
source: Enter Restaurant Information
ar: أدخل معلومات المطعم

source: Reset
ar: إعادة تعيين

source: No image selected
ar: لم يتم اختيار صورة

source: Logo
ar: الشعار

# enterNameAR
source: Enter restaurant Arabic name.
ar: أدخل اسم المطعم باللغة العربية

# enterNameEN
source: Enter restaurant English name.
ar: أدخل اسم المطعم باللغة الانكليزية

# editRestaurant
source: Edit Restaurant Info.
ar: تعديل معلومات المطعم

# categoryNotAdded
source: Failed to add a new category, please try again.
ar: لم يتم إضافة صنف جديد, الرجاء إعادة المحاولة

# categoryAdded
source: A new category has been added successfully
ar: تم إضافة صنف جديد بنجاح

# categoryNotDeleted
source: Failed to delete category
ar: لم يتم حذف الصنف

# categoryDeleted
source: 'Category {category} and its Meals collection added successfully!'
ar: تم حذف الصنف {category} وكامل وجباته

# mealNotDeleted
source: Failed to delete a meal\nPlease try again later
ar: لم يتم حذف الوجبة, الرجاء إعادة المحاولة

# mealDeleted
source: Meal has been deleted successfully
ar: تم حذف الوجبة بنجاح

# mealNotEdited
source: Meal has not being edited, Please try again.
ar: لم يتم تعديل الوجبة, الرجاء إعادة المحاولة

# mealEdited
source: Meal has been edited successfully
ar: تم تعديل الوجبة بنجاح

# mealNotAdded
source: Meal has not being added, Please try again.
ar: لم يتم إضافة الوجبة, الرجاء إعادة المحاولة

source: Error
ar: خطأ

# mealAdded
source: New meal has been added successfully
ar: تم إضافة وجبة جديدة بنجاح

source: Success
ar: نجح الأمر

source: Dashboard
ar: لوحة التحكم

# selectCategoryDelete
source: Please select the category to delete
ar: الرجاء اختيار الصنف المراد حذفه

source: Delete Category
ar: حدف صنف

# enterMealIDforDelete
source: Enter the meal's ID to delete
ar: أدخل رقم المعرف للوجبة المراد حذفها

source: Delete Meal
ar: حذف وجبة

source: Category Name
ar: اسم الصنف

# enterCategoryName
source: Please enter the new category's name
ar: أدخل اسم الصنف الجديد

# addCategory
source: Add New Category
ar: إضافة صنف جديد

source: Submit
ar: تأكيد

# mealNotFoundDesc
source: No meals found with the entered ID and category.
ar: الرجاء إدخال الرقم المعرف واختيار الصنف الصحيح

source: Meal Not Found
ar: لم يتم إيجاد الوجبة المطلوبة

source: Meal ID
ar: الرقم المعرف

# fillID_Category
source: Please enter the meal's ID and category:
ar: أدخل رقم المعرف وصنف الوجبة

source: Edit Meal
ar: تعديل وجبة

# informationFill
source: Please fill all required information.
ar: الرجاء ملئ المعلومات المطلوبة

source: Missing Information
ar: المعلومات ناقصة

source: Images
ar: الصور

# enterComponent
source: Enter a component.
ar: أدخل أحد المكونات

source: Component
ar: مكون

# enterOption
source: Enter an option
ar: أدخل أحد الخيارات

source: Option
ar: خيار

source: Description
ar: الوصف

source: Name
ar: الاسم

source: title
ar: اللقب

source: Add Meal
ar: إضافة وجبة

source: Restaurant Name
ar: اسم المطعم

source: Slogan
ar: الشعار

source: Eastern Meals
ar: وجبات شرقية

source: Eastern
ar: شرقي

source: Western Meals
ar: وجبات غربية

source: Western
ar: غربي

source: Drinks
ar: مشروبات

source: My Favorites
ar: المفضلة

source: Login
ar: تسجيل الدخول

source: User Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

# noAccount
source: Do not have account?
ar: ليس لديك حساب!

source: SignUp
ar: التسجيل

source: Show Orders
ar: عرض الطلبيات

source: Close.
ar: انهاء

source: Search for more
ar: ابحث عن المزيد

source: Go to order list
ar: اذهب إلى الطلب

# addToOrder
source: Add to My Order
ar: أضف إلى الطلب

source: Filter
ar: فلترة

source: Category
ar: الصنف

source: Price
ar: السعر

# orderDetails
source: Order {orderID} Details
ar: {orderID} تفاصيل الطلب

source: Client Note:
ar: ملاحظات الزبون

source: My Order
ar: الطلب الخاص بي

source: Client Name
ar: اسم الزبون

source: Table NO.
ar: رقم الطاولة

# leaveNote
source: Leave a note
ar: اترك ملاحظة

# noNameID
source: Please enter the Client Name & Table NO.
ar: الرجاء ادخال اسم الزبون ورقم الطاولة

source: OK.
ar: تم.

source: Confirm Order
ar: تأكيد الطلب

source: Get Orders
ar: تحميل الطلبات

source: Delete
ar: حذف

source: Client
ar: الزبون

source: Items
ar: الوجبات

# mealSearch
source: Search for a Meal..
ar: ابحث عن وجبة

# notFound
source: Item not found
ar: لم يتم إيجاد وجبات مطابقة

source: User Name
ar: اسم المستخدم

# latestMeals
source: Recently Added
ar: مضافة حديثاً

source: Show All
ar: رؤية الكل

source: New Order
ar: طلب جديد

# newOrderBody
source: A new order has been added
ar: تم إضافة طلب جديد.

# mealAddedBody
source: The item has been added to your order list.
ar: تم إضافة الوجبة إلى الطلب

source: Item Added
ar: تم إضافة الوجبة

source: Clear All
ar: مسح الكل

# orderAdded
source: Order added, thanks for your patient.. Order ID: {orderID},
ar: تم إضافة الطلب رقم الطلب {orderID}

source: Options:
ar: الخيارات:

source: Components:
ar: المكونات:

# orderNew
source: New
ar: جديد

source: Cooking
ar: قيد الطبخ

source: Done Cooking
ar: انتهى الطبخ

source: Done
ar: تم التقديم

# orderStatus
source: Status:
ar: حالة الطلب:

# orderStatusExp
source: Order Status: {status}
ar: حالة الطلب: {status}
